const { cmd } = require("../command");

cmd({
    pattern: "menu",
    desc: "Show full Suho MD menu",
    category: "main",
    filename: __filename
}, async (conn, mek, m, { reply }) => {

const menuImage = "https://files.catbox.moe/6tzxgo.jpg";

const cmds = `

╔═══════〔 <💠> 𝙎𝙐𝙃𝙊 𝙈𝘿 𝙑2 <💠> 〕═══════╗
║ 🧑 𝙐𝙨𝙚𝙧: ${m.pushName}
║ 🤖 𝘽𝙤𝙩: 𝙎𝙪𝙝𝙤 𝙈𝘿 𝙑2
║ 👑 𝙊𝙬𝙣𝙚𝙧: 𝙇𝙊𝙍𝘿 𝙎𝙐𝙉𝙂
╚══════════════════════════════════════╝

━━━━━━━━━━━━━━━━━━━━━━━━━━
💠 *U R L*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝚃𝚘𝚞𝚛𝚕

━━━━━━━━━━━━━━━━━━━━━━━━━━
👑 *O W N E R*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙰𝚍𝚍𝚡𝚙  
𝙰𝚕𝚕𝚞𝚜𝚎𝚛𝚜  
𝙰𝚞𝚝𝚘𝚛𝚎𝚌𝚘𝚛𝚍  
𝙱𝚊𝚗  
𝚄𝚗𝚋𝚊𝚗  
𝙰𝚍𝚖𝚒𝚗  
𝙼𝚘𝚍𝚜  
𝚂𝚎𝚝𝚋𝚘𝚝  
𝙰𝚍𝚍𝚜𝚞𝚍𝚘  
𝚁𝚎𝚖𝚘𝚟𝚎𝚜𝚞𝚍𝚘

━━━━━━━━━━━━━━━━━━━━━━━━━━
🧠 *A I*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙰𝚒  
𝙾𝚙𝚎𝚗𝚊𝚒  
𝙳𝚎𝚎𝚙𝚜𝚎𝚎𝚔  
𝙰𝚜𝚔  
𝙵𝚕𝚞𝚡𝚊𝚒  
𝚂𝚝𝚊𝚋𝚕𝚎𝚍𝚒𝚏𝚏𝚞𝚜𝚒𝚘𝚗  
𝚂𝚝𝚊𝚋𝚒𝚕𝚒𝚝𝚢𝙰𝙸  
𝙽𝚘𝚟𝚊  
𝚂𝚞𝚖𝚖𝚊𝚛𝚒𝚣𝚎  
𝚃𝚘𝚏𝚒𝚐𝚞𝚛𝚎

━━━━━━━━━━━━━━━━━━━━━━━━━━
📍 *M A I N*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙰𝚕𝚒𝚟𝚎  
𝙰𝚕𝚕𝚖𝚎𝚗𝚞  
𝙳𝚎𝚟𝚏𝚊𝚖𝚒𝚕𝚢  
𝙷𝚎𝚕𝚙  
𝙻𝚒𝚜𝚝  
𝙻𝚒𝚟𝚎  
𝙼𝚎𝚗𝚞  
𝙼𝚎𝚗𝚞1  
𝙼𝚎𝚗𝚞3  
𝙼𝚢𝚒𝚗𝚏𝚘  
𝙱𝚕𝚘𝚌𝚔  
𝚁𝚎𝚙𝚘  
𝚂𝚎𝚛𝚟𝚎𝚛  
𝚂𝚢𝚜𝚝𝚎𝚖  
𝚄𝚙𝚝𝚒𝚖𝚎  
𝚅𝚎𝚛𝚜𝚒𝚘𝚗

━━━━━━━━━━━━━━━━━━━━━━━━━━
🎮 *G A M E S*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙿𝚞𝚕𝚕𝚌𝚊𝚛𝚍  
𝙼𝚢𝚌𝚊𝚛𝚍𝚜  
𝚂𝚎𝚕𝚕𝚌𝚊𝚛𝚍  
𝙲𝚊𝚛𝚍𝚋𝚊𝚝𝚝𝚕𝚎  
𝚃𝚛𝚊𝚍𝚎𝚌𝚊𝚛𝚍  
𝙳𝚒𝚌𝚎  
𝙲𝚘𝚒𝚗𝚏𝚕𝚒𝚙  
𝚁𝚙𝚜  
𝚂?𝚕𝚘𝚝𝚜  
𝙷𝚊𝚗𝚐𝚖𝚊𝚗  
𝙼𝚢𝚙𝚘𝚔𝚎𝚖𝚘𝚗  
𝙿𝚘𝚔𝚎𝚏𝚒𝚐𝚑𝚝  
𝙲𝚊𝚝𝚌𝚑  
𝙿𝚜𝚝𝚘𝚛𝚎  
𝙱𝚞𝚢𝚒𝚝𝚎𝚖  
𝙸𝚗𝚟𝚎𝚗𝚝𝚘𝚛𝚢  
𝚂𝚝𝚊𝚛𝚝-𝚓𝚘𝚞𝚛𝚗𝚎𝚢

━━━━━━━━━━━━━━━━━━━━━━━━━━
🎉 *F U N*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙰𝚗𝚒𝚖𝚎𝚙𝚒𝚌  
𝙰𝚗𝚒𝚖𝚎𝚚𝚞𝚘𝚝𝚎  
𝙲𝚘𝚒𝚗𝚏𝚕𝚒𝚙  
𝙲𝚘𝚖𝚙𝚊𝚝𝚒𝚋𝚒𝚕𝚒𝚝𝚢  
𝙰𝚞𝚛𝚊  
𝚁𝚘𝚊𝚜𝚝  
𝟠𝚋𝚊𝚕𝚕  
𝙲𝚘𝚖𝚙𝚕𝚒𝚖𝚎𝚗𝚝  
𝙻𝚘𝚟𝚎𝚝𝚎𝚜𝚝  
𝙴𝚖𝚘𝚓𝚒  
𝙹𝚘𝚔𝚎  
𝙷𝚊𝚌𝚔  
𝚁𝚘𝚕𝚕  
𝚃𝚘𝚍

━━━━━━━━━━━━━━━━━━━━━━━━━━
🛠️ *U T I L I T Y*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙰𝚗𝚝𝚒𝚍𝚎𝚕𝚎𝚝𝚎  
𝚂𝚝𝚒𝚌𝚔𝚎𝚛  
𝙿𝚒𝚗𝚐  
𝙿𝚒𝚗𝚐2  
𝚂𝚎𝚛𝚟𝚎𝚛𝚜𝚝𝚊𝚝𝚜  
𝚃𝚘𝚒𝚖𝚐  
𝚆𝚑𝚘𝚒𝚜

━━━━━━━━━━━━━━━━━━━━━━━━━━
💸 *E C O N O M Y*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝚆𝚊𝚕𝚕𝚎𝚝  
𝙳𝚊𝚒𝚕𝚢  
𝚂𝚎𝚗𝚍  
𝙰𝚍𝚍𝚌𝚘𝚒𝚗𝚜  
𝚁𝚎𝚖𝚘𝚟𝚎𝚌𝚘𝚒𝚗𝚜  
𝚁𝚎𝚜𝚎𝚝𝚞𝚜𝚎𝚛  
𝚁𝚎𝚜𝚎𝚝𝚊𝚕𝚕  
𝚆𝚘𝚛𝚔  
𝙱𝚎𝚐  
𝙷𝚞𝚗𝚝  
𝚂𝚎𝚕𝚕  
𝚂𝚕𝚘𝚝𝚜  
𝙻𝚋

━━━━━━━━━━━━━━━━━━━━━━━━━━
🎰 *C A S I N O*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙳𝚒𝚌𝚎𝚍𝚞𝚎𝚕  
𝙲𝚘𝚒𝚗𝚡  
𝚂𝚕𝚘𝚝𝚜𝚙𝚛𝚘  
𝙱𝚕𝚊𝚌𝚔𝚓𝚊𝚌𝚔  
𝚁𝚘𝚞𝚕𝚎𝚝𝚝𝚎  
𝙲𝚛𝚊𝚙𝚜  
𝙱𝚊𝚌𝚌𝚊𝚛𝚊𝚝  
𝙷𝚒𝚕𝚘  
𝙽𝚞𝚖𝚐𝚞𝚎𝚜𝚜  
𝙹𝚊𝚌𝚔𝚙𝚘𝚝

━━━━━━━━━━━━━━━━━━━━━━━━━━
📥 *D O W N L O A D*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙵𝚋  
𝚂𝚘𝚗𝚐  
𝚅𝚒𝚍𝚎𝚘  
𝙿𝚕𝚊𝚢  
𝚂𝚙𝚘𝚝𝚒𝚏𝚢  
𝚃𝚒𝚔𝚝𝚘𝚔

━━━━━━━━━━━━━━━━━━━━━━━━━━
📦 *T O O L S*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙸𝚖𝚊𝚐𝚎𝚞𝚛𝚕  
𝙸𝚙𝚕𝚘𝚘𝚔𝚞𝚙  
𝙿𝚒𝚗𝚐  
𝙲𝚊𝚕𝚌  
𝚂𝚑𝚘𝚛𝚝  
𝙌𝚛  
𝚃𝚛  
𝚆𝚎𝚊𝚝𝚑𝚎𝚛  
𝙳𝚒𝚌𝚝  
𝙲𝚞𝚛𝚛𝚎𝚗𝚌𝚢  
𝙱𝚊𝚜𝚎64  
𝚄𝚗𝚋𝚊𝚜𝚎64  
𝚂𝚌𝚛𝚎𝚎𝚗𝚜𝚑𝚘𝚝  
𝙵𝚊𝚌𝚝  
𝙹𝚘𝚔𝚎  
𝙼𝚎𝚖𝚎  
𝚃𝚝𝚜  
𝙾𝚌𝚛  
𝙿𝚍𝚏𝚖𝚎𝚛𝚐𝚎  
𝙿𝚍𝚏𝚜𝚙𝚕𝚒𝚝  
𝙿𝚍𝚏𝚝𝚘𝚝𝚎𝚡𝚝  
𝙸𝚖𝚐2𝚙𝚍𝚏  
𝙿𝚍𝚏2𝚒𝚖𝚐  
𝙿𝚊𝚜𝚜𝚠𝚘𝚛𝚍  
𝚄𝚞𝚒𝚍  
𝙰𝚜𝚌𝚒𝚒  
𝙼𝚘𝚛𝚜𝚎  
𝚄𝚗𝚖𝚘𝚛𝚜𝚎  
𝙱𝚒𝚗𝚊𝚛𝚢  
𝚄𝚗𝚋𝚒𝚗𝚊𝚛𝚢  
𝙷𝚎𝚡  
𝚄𝚗𝚑𝚎𝚡  
𝚁𝚎𝚟𝚎𝚛𝚜𝚎  
𝚁𝚊𝚗𝚍𝚘𝚖𝚗𝚞𝚖  
𝚁𝚘𝚕𝚕  
𝙵𝚕𝚒𝚙  
𝚀𝚞𝚘𝚝𝚎  
𝙰𝚍𝚟𝚒𝚌𝚎  
𝙲𝚊𝚝  
𝙳𝚘𝚐  
𝙵𝚘𝚡  
𝙰𝚗𝚒𝚖𝚎  
𝚆𝚊𝚒𝚏𝚞  
𝚁𝚎𝚖𝚒𝚗𝚍𝚎𝚛  
𝙽𝚘𝚝𝚎  
𝚃𝚒𝚖𝚎𝚛  
𝚂𝚝𝚘𝚙𝚠𝚊𝚝𝚌𝚑  
𝙰𝚕𝚊𝚛𝚖  
𝚂𝚘𝚗𝚐𝚜𝚎𝚊𝚛𝚌𝚑  
𝙻𝚢𝚛𝚒𝚌𝚜  
𝙼𝚘𝚟𝚒𝚎  
𝚃𝚟  
𝙽𝚎𝚠𝚜

━━━━━━━━━━━━━━━━━━━━━━━━━━
👑 *V I P*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝚅𝚒𝚙  
𝚅𝚒𝚙𝚍𝚒𝚌𝚎  
𝚅𝚒𝚙𝚜𝚕𝚘𝚝  
𝚅𝚒𝚙𝚌𝚘𝚒𝚗𝚏𝚕𝚒𝚙  
𝚅𝚒𝚙𝚐𝚞𝚎𝚜𝚜  
𝚅𝚒𝚙𝚝𝚊𝚛𝚐𝚎𝚝  
𝚅𝚒𝚙𝚋𝚕𝚊𝚌𝚔𝚓𝚊𝚌𝚔  
𝚅𝚒𝚙𝚠𝚑𝚎𝚎𝚕  
𝚅𝚒𝚙𝚓𝚊𝚌𝚔𝚙𝚘𝚝  
𝚅𝚒𝚙𝚛𝚊𝚏𝚏𝚕𝚎  
𝚅𝚒𝚙𝚙𝚘𝚔𝚎𝚛

━━━━━━━━━━━━━━━━━━━━━━━━━━
✨ *H I D D E N*
━━━━━━━━━━━━━━━━━━━━━━━━━━
𝙶𝚘𝚍𝚖𝚘𝚍𝚎  
𝚂𝚑𝚊𝚍𝚘𝚠𝚋𝚊𝚗  
𝚁𝚎𝚟𝚎𝚊𝚕  
𝙳𝚊𝚛𝚔𝚐𝚒𝚏𝚝  
𝚂𝚎𝚌𝚛𝚎𝚝𝚖𝚎𝚗𝚞


╔══════〔 ⚡ 𝙋𝙊𝙒𝙀𝙍𝙀𝘿 𝘽𝙔 𝙎𝙐𝙃𝙊 𝙈𝘿 𝙑2 ⚡ 〕══════╗
║   By Lord Sung
╚═══════════════════════════════════════════╝
`;

await conn.sendMessage(m.chat, {
  image: { url: menuImage },
  caption: cmds
});

});